from langchain_core.prompts import ChatPromptTemplate
from langchain_core.output_parsers import StrOutputParser
from models import llm
from langchain_core.runnables import RunnableLambda

verification_prompt = ChatPromptTemplate.from_template("""
Ти — редактор історичного асистента.

Твоє завдання — перевірити готову відповідь на запитання
та ВИПРАВИТИ її так, щоб вона не містила тверджень,
яких немає в наданих матеріалах.

ВАЖЛИВО:

1. Використовуй ТІЛЬКИ інформацію з матеріалів.
2. Не додавай власних історичних знань.
3. Перевіряй кожен конкретний факт:
   - дати;
   - імена;
   - події;
   - числа;
   - причини;
   - наслідки.
4. Якщо твердження не підтверджується матеріалами,
   видали його або заміни на підтверджене формулювання.
5. Особливо уважно перевіряй причинно-наслідкові зв'язки.
6. Не перенось факти між різними історичними періодами.
7. Не використовуй інформацію лише тому, що вона тематично схожа.
8. Якщо інформація правильна — залиш її.
9. Не переписуй відповідь без причини.
10. Не пояснюй, що саме виправив. Поверни тільки готову відповідь.
11. Не згадуй слова «матеріал», «контекст», «джерело»,
    «перевірка» або «RAG».
12. Не додавай нових фактів.
13. Не розказуй що тобі надаються матеріали для формування відповіді

ФОРМАТУВАННЯ:
- HTML для Telegram.
- <b> для важливих понять.
- <i> для термінів або назв.
- Не використовуй Markdown або потрійні бектики.

МАТЕРІАЛИ:
{context}

ЗАПИТАННЯ:
{query}

ПОПЕРЕДНЯ ВІДПОВІДЬ:
{res}

ВИПРАВЛЕНА ВІДПОВІДЬ:
""")

verification_chain = (
    RunnableLambda(
        lambda data: {
            "query": data["query"],
            "context": data["context"],
            "res": data["answer"],
        }
    )
    | verification_prompt
    | llm
    | StrOutputParser()
)
